23-rails-sessions-cookies/app/controllers/application_controller.rb

  def show_cart
    @cart_items = Nacho.find(cart)
---
SELECT  "nachos".* FROM "nachos" WHERE "nachos"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]